tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'wez/wezterm'

brew 'aws-cdk'
brew 'aws-sam-cli'
brew 'awscli'
brew 'bat'
brew 'direnv'
brew 'gcc'
brew 'gcc@11'
brew 'gh'
brew 'git-delta'
brew 'git-flow'
brew 'glab'
brew 'k9s'
brew 'krew'
brew 'kubernetes-cli'
brew 'mas'
brew 'neovim', args: ['head']
brew 'poetry'
brew 'pre-commit'
brew 'pulumi'
brew 'pyenv'
brew 'rustup'
brew 's3cmd'
brew 'terraform'
brew 'tree-sitter'
brew 'yadm'

cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'discord'
cask 'docker'
cask 'flycut'
cask 'gpg-suite'
cask 'iterm2'
cask 'microsoft-teams'
cask 'obsidian'
cask 'notion'
cask 'postman'
cask 'slack'
cask 'visual-studio-code'
cask 'wezterm'

mas '1Password for Safari', id: 1569813296
mas 'Keynote', id: 409183694
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
mas 'Yubico Authenticator', id: 1497506650

# vim:ft=brewfile
