tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'wez/wezterm'

brew 'ansible'
brew 'awscli'
brew 'bat'
brew 'direnv'
brew 'gcc'
brew 'gcc@11'
brew 'git-delta'
brew 'git-flow'
brew 'gh'
brew 'glab'
brew 'k9s'
brew 'krew'
brew 'kubernetes-cli'
brew 'mas'
brew 'neovim', args: ['head']
brew 'poetry'
brew 'pre-commit'
brew 'pulumi'
brew 'rustup'
brew 's3cmd'
brew 'terraform'
brew 'tree-sitter'
brew 'yadm'
brew 'neovim', args: ['head']

cask '1password-beta'
cask '1password-cli-beta'
cask 'alfred'
cask 'discord'
cask 'flycut'
cask 'gpg-suite'
cask 'iterm2'
cask 'microsoft-teams'
cask 'postman'
cask 'rancher'
cask 'slack'
cask 'visual-studio-code'
cask 'wezterm'

mas '1Password for Safari', id: 1569813296
mas 'Grocery', id: 1195676848
mas 'Home Assistant', id: 1099568401
mas 'Keka', id: 470158793
mas 'Keynote', id: 409183694
mas 'Parcel', id: 639968404
mas 'PayPal Honey', id: 1472777122
mas 'The Unarchiver', id: 425424353
mas 'UTM', id: 1538878817
mas 'Xcode', id: 497799835
mas 'Yubico Authenticator', id: 1497506650

# vim:ft=brewfile
